#09012024
# Implement EDS technique on Dataset to build ML Model
# Data Cleaning
# Raw Data To Clean Data conversion using Python EDA

In [1]:
import pandas as pd

In [3]:
pd.__version__

'2.2.2'

In [125]:
emp=pd.read_excel(r'C:\Raju\DataScience_AIML\Naresh_IT\Documents\Python_Code\09012024\Rawdata.xlsx')

In [127]:
emp

     Name          Domain       Age   Location   Salary      Exp
0    Mike   Datascience#$  34 years     Mumbai   5^00#0       2+
1  Teddy^         Testing    45' yr  Bangalore  10%%000       <3
2   Uma#r  Dataanalyst^^#       NaN        NaN  1$5%000   4> yrs
3    Jane     Ana^^lytics       NaN   Hyderbad   2000^0      NaN
4  Uttam*      Statistics     67-yr        NaN   30000-  5+ year
5     Kim             NLP      55yr      Delhi  6000^$0      10+

In [13]:
id(emp)

3111217538704

In [129]:
emp.columns

Index(['Name', 'Domain', 'Age', 'Location', 'Salary', 'Exp'], dtype='object')

In [131]:
emp.shape

(6, 6)

In [133]:
emp.head()

     Name          Domain       Age   Location   Salary      Exp
0    Mike   Datascience#$  34 years     Mumbai   5^00#0       2+
1  Teddy^         Testing    45' yr  Bangalore  10%%000       <3
2   Uma#r  Dataanalyst^^#       NaN        NaN  1$5%000   4> yrs
3    Jane     Ana^^lytics       NaN   Hyderbad   2000^0      NaN
4  Uttam*      Statistics     67-yr        NaN   30000-  5+ year

In [135]:
emp.tail()

     Name          Domain     Age   Location   Salary      Exp
1  Teddy^         Testing  45' yr  Bangalore  10%%000       <3
2   Uma#r  Dataanalyst^^#     NaN        NaN  1$5%000   4> yrs
3    Jane     Ana^^lytics     NaN   Hyderbad   2000^0      NaN
4  Uttam*      Statistics   67-yr        NaN   30000-  5+ year
5     Kim             NLP    55yr      Delhi  6000^$0      10+

In [25]:
emp.info() # Table data info with not null values

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      6 non-null      object
 1   Domain    6 non-null      object
 2   Age       4 non-null      object
 3   Location  4 non-null      object
 4   Salary    6 non-null      object
 5   Exp       5 non-null      object
dtypes: object(6)
memory usage: 420.0+ bytes

In [29]:
#emp.isnull()
emp.isna() # Both sina and isnUll give same result

    Name  Domain    Age  Location  Salary    Exp
0  False   False  False     False   False  False
1  False   False  False     False   False  False
2  False   False   True      True   False  False
3  False   False   True     False   False   True
4  False   False  False      True   False  False
5  False   False  False     False   False  False

In [31]:
emp.isnull().sum()

Name        0
Domain      0
Age         2
Location    2
Salary      0
Exp         1
dtype: int64

In [33]:
emp['Name']

0      Mike
1    Teddy^
2     Uma#r
3      Jane
4    Uttam*
5       Kim
Name: Name, dtype: object

In [137]:
emp['Name'] = emp['Name'].str.replace(r'\W', '', regex=True) # to remove spaces in the values.

In [139]:
emp['Name']

0     Mike
1    Teddy
2     Umar
3     Jane
4    Uttam
5      Kim
Name: Name, dtype: object

In [41]:
emp.head()

    Name          Domain       Age   Location   Salary      Exp
0   Mike   Datascience#$  34 years     Mumbai   5^00#0       2+
1  Teddy         Testing    45' yr  Bangalore  10%%000       <3
2   Umar  Dataanalyst^^#       NaN        NaN  1$5%000   4> yrs
3   Jane     Ana^^lytics       NaN   Hyderbad   2000^0      NaN
4  Uttam      Statistics     67-yr        NaN   30000-  5+ year

In [141]:
emp['Domain'] = emp['Domain'].str.replace(r'\W', '', regex=True)   # to remove spaces in the values in domain column
emp['Domain']

0    Datascience
1        Testing
2    Dataanalyst
3      Analytics
4     Statistics
5            NLP
Name: Domain, dtype: object

In [143]:
emp['Age'] = emp['Age'].str.replace(r'\W', '', regex=True)   # to remove spaces in the values in Age column
emp['Age']

0    34years
1       45yr
2        NaN
3        NaN
4       67yr
5       55yr
Name: Age, dtype: object

In [145]:
emp['Age'] = emp['Age'].str.extract('(\d+)') # To remove extra words from the column and only digit will display.
emp['Age']

<>:1: SyntaxWarning: invalid escape sequence '\d'
<>:1: SyntaxWarning: invalid escape sequence '\d'
C:\Users\nagarajg\AppData\Local\Temp\ipykernel_9184\3195926654.py:1: SyntaxWarning: invalid escape sequence '\d'
  emp['Age'] = emp['Age'].str.extract('(\d+)') # To remove extra words from the column and only digit will display.

0     34
1     45
2    NaN
3    NaN
4     67
5     55
Name: Age, dtype: object

In [147]:
emp['Location'] = emp['Location'].str.replace(r'\W', '', regex=True)   # to remove spaces in the values in Age column
emp['Location']

0       Mumbai
1    Bangalore
2          NaN
3     Hyderbad
4          NaN
5        Delhi
Name: Location, dtype: object

In [149]:
emp['Salary'] = emp['Salary'].str.replace(r'\W', '', regex=True)   # to remove spaces in the values in Age column
emp['Salary']

0     5000
1    10000
2    15000
3    20000
4    30000
5    60000
Name: Salary, dtype: object

In [151]:
emp['Exp'] = emp['Exp'].str.replace(r'\W', '', regex=True)   # to remove spaces in the values in Age column
emp['Exp']

0        2
1        3
2     4yrs
3      NaN
4    5year
5       10
Name: Exp, dtype: object

In [153]:
emp['Exp'] = emp['Exp'].str.extract('(\d+)') 
emp['Exp']

<>:1: SyntaxWarning: invalid escape sequence '\d'
<>:1: SyntaxWarning: invalid escape sequence '\d'
C:\Users\nagarajg\AppData\Local\Temp\ipykernel_9184\726201320.py:1: SyntaxWarning: invalid escape sequence '\d'
  emp['Exp'] = emp['Exp'].str.extract('(\d+)')

0      2
1      3
2      4
3    NaN
4      5
5     10
Name: Exp, dtype: object

In [155]:
emp.head()

    Name       Domain  Age   Location Salary  Exp
0   Mike  Datascience   34     Mumbai   5000    2
1  Teddy      Testing   45  Bangalore  10000    3
2   Umar  Dataanalyst  NaN        NaN  15000    4
3   Jane    Analytics  NaN   Hyderbad  20000  NaN
4  Uttam   Statistics   67        NaN  30000    5

In [157]:
clean_Data = emp.copy()

In [159]:
clean_Data

    Name       Domain  Age   Location Salary  Exp
0   Mike  Datascience   34     Mumbai   5000    2
1  Teddy      Testing   45  Bangalore  10000    3
2   Umar  Dataanalyst  NaN        NaN  15000    4
3   Jane    Analytics  NaN   Hyderbad  20000  NaN
4  Uttam   Statistics   67        NaN  30000    5
5    Kim          NLP   55      Delhi  60000   10

#Till now we have raw data we use regex

In [161]:
clean_Data.isnull().sum()

Name        0
Domain      0
Age         2
Location    2
Salary      0
Exp         1
dtype: int64

In [105]:
import numpy as np

In [163]:
clean_Data['Age'] = clean_Data['Age'].fillna(np.mean(pd.to_numeric(clean_Data['Age']) ) )

In [113]:
clean_Data

    Name       Domain    Age Location Salary  Exp
0   Mike  Datascience     34  34years   5000    2
1  Teddy      Testing     45     45yr  10000    3
2   Umar  Dataanalyst  50.25      NaN  15000    4
3   Jane    Analytics  50.25      NaN  20000  NaN
4  Uttam   Statistics     67     67yr  30000    5
5    Kim          NLP     55     55yr  60000   10

In [165]:
clean_Data['Location'] = clean_Data['Location'].fillna(clean_Data['Location'].mode()[0])

In [167]:
clean_Data['Location']

0       Mumbai
1    Bangalore
2    Bangalore
3     Hyderbad
4    Bangalore
5        Delhi
Name: Location, dtype: object

In [169]:
clean_Data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      6 non-null      object
 1   Domain    6 non-null      object
 2   Age       6 non-null      object
 3   Location  6 non-null      object
 4   Salary    6 non-null      object
 5   Exp       5 non-null      object
dtypes: object(6)
memory usage: 420.0+ bytes

In [171]:
clean_Data['Age'] = clean_Data['Age']. astype(int)

In [173]:
clean_Data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      6 non-null      object
 1   Domain    6 non-null      object
 2   Age       6 non-null      int32
 3   Location  6 non-null      object
 4   Salary    6 non-null      object
 5   Exp       5 non-null      object
dtypes: int32(1), object(5)
memory usage: 396.0+ bytes

In [189]:
clean_Data['Name'] = clean_Data['Name'].astype('category')

In [191]:
clean_Data['Domain'] = clean_Data['Domain']. astype('category')
clean_Data['Location'] = clean_Data['Location']. astype('category')

In [193]:
clean_Data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      6 non-null      category
 1   Domain    6 non-null      category
 2   Age       6 non-null      int32
 3   Location  6 non-null      category
 4   Salary    6 non-null      object
 5   Exp       5 non-null      object
dtypes: category(3), int32(1), object(2)
memory usage: 914.0+ bytes

In [195]:
clean_Data.to_csv('clean_data.csv') # create csv file using existing data.

In [197]:
clean_Data

    Name       Domain  Age   Location Salary  Exp
0   Mike  Datascience   34     Mumbai   5000    2
1  Teddy      Testing   45  Bangalore  10000    3
2   Umar  Dataanalyst   50  Bangalore  15000    4
3   Jane    Analytics   50   Hyderbad  20000  NaN
4  Uttam   Statistics   67  Bangalore  30000    5
5    Kim          NLP   55      Delhi  60000   10

In [199]:
imputation.columns

NameError: name 'imputation' is not defined